'''
# 최단 경로 문제
- 최단 경로 알고리즘 : 그래프 상 가장 짧은 경로를 찾는 알고리즘
    - 다익스트라 알고리즘: 한 지점에서 다른 모든 지점까지의 최단 경로를 계산
    - 플로이드 워셜: 모든 지점에서 다른 모든 지점까지의 최단 경로를 계산

- 다익스트라 알고리즘
   : '단계마다 방문하지 않은 노드 중에서 가장 최단 거리가 짧은 노드를 선택' 후,
   그 노드를 거쳐 가는 경우를 확인하여 최단거리를 갱신하는 방법
   : 우선순위 큐를 이용하여 소스코드 작성

- 플로이등 워셜 알고리즘
   : 다이나믹 프로그래밍을 이용하여 단계마다 '거쳐가는 노드'를 기준으로 최단거리 테이블을 갱신하는 방식
   - 점화식 : Dab = min(Dab, Dak + Dkb)
   for k in range(1, n+1):
        for a in range(1, n+1):
            for b in range(1, n+1):
                abj[a][b] = min(abj[a][b], abj[k][a] + abj[k][b])
'''











if __name__ == "__main__":